//#include <iostream>
////Ванката има S стълбища в своя дом, които обича да изкачва през 1, 2 или 3 стъпала.
//// Понеже е много любознателен и не обича да му е скучно, той се чуди по колко различни начина 
//// може да изкачи всяко стълбище.Да се напише програма, кояго пресмята възможните начини.
////На първия ред от стандартния вход се задава S - броя стълбища.Всеки от следващите S реда съдържа число N - броя стълби на всяко стълбище.
//
//
//unsigned power(unsigned base, unsigned pow) {
//	if (pow == 0)
//	{
//		return 1;
//	}
//
//	if (pow == 1)
//	{
//		return base;
//	}
//
//	if (pow%2)
//	{
//		return power(base, pow - 1) * base;
//	}
//
//	unsigned result = power(base, pow / 2);
//	return result * result;
//}
//int main() {
//
//}